use anyhow::Result;
use qdrant_client::{qdrant::{CreateCollectionBuilder, Distance, PointStruct, UpsertPointsBuilder, VectorParamsBuilder}, Payload, Qdrant};
use serde_json::json;
use vector_db::{constants::{COLLECTION_NAME, CONNECTION_STRING, VECTOR_SIZE}, tools::embed};


#[tokio::main]
async fn main() -> Result<()> {
    dotenv::dotenv().ok();
    let client = Qdrant::from_url(CONNECTION_STRING).build()?;
    
    if !client.collection_exists(COLLECTION_NAME).await? {
        client.create_collection(
            CreateCollectionBuilder::new(COLLECTION_NAME)
                .vectors_config(VectorParamsBuilder::new(VECTOR_SIZE, Distance::Cosine))   
        )
        .await?;
    }

    let texts_ua = vec![
        String::from("Для повного видалення волосся необхідно пройти курс процедур, в середньому від 4 до 8, курс індивідуальний та залежить від типу шкіри та структури волосини. Для гормонозалежних зон середній курс становить від 10 сеансів. По завершенню курсу знадобиться робити 1-2 підтримуючі процедури на рік. "),
        String::from("Інтервал між першою і другою процедурою 4-6 тижнів, з кожною наступною процедурою він збільшується на 2 тижні, тобто 6-8 тижнів, 8-10 тижнів і т. д."),
        String::from("Лазерна епіляція \"Золотий стандарт\" підходить для більш жорсткого темного волосся, процедура проводиться на гладеньку поверхність, \"Ексклюзив\" - більш ефективна для пушкового пігментованого волосся, проводиться на відросле волосся. Якщо у Вас зовсім світле чи сиве волосся, то ефективніше буде Нано епіляція."),
        String::from("Підготовка: \n• 2 тижні до процедури оброблювана зона не повинна засмагати;\n• не можна висмикувати волосся в цій зоні/зонах за 2 тижні до процедури;\n• не можна протирати зону/зони спиртовмісними засобами за 3 дні до процедури;\n• не можна приймати антибіотики тетрациклінового ряду, фторхінолонів та сульфаніламідів за 2 тижні до процедури;\n• за 4-8 годин до процедури зону/зони епіляції потрібно ретельно поголити."),
        String::from("Післяпроцедурний режим: Не засмагати протягом 2 х тижнів після процедури; Протягом 3 х днів не приймати ванну з гарячою водою; Не відвідувати басейни з хлорованою водою, лазні і сауни протягом 3 х днів після процедури; 3 дні після епіляції не обробляйте шкіру речовинами, що містять спирт. "),
        String::from("На наступний день після процедури стрижень волосини починає виштовхуватись на поверхню, буде складатись враження, що волосся починає відростати,але якщо за нього через 2-3 тижні потягнути, воно почне витягуватись без коріння. Початковий результат від процедури Ви зможете спостерігати не раніше 2-3 тижнів, коли волосся почне випадати «острівцями»- це дуже хороший результат."),
        String::from("Після процедури в області епіляції можливо почервоніння, яке проходить протягом декількох годин.Необхідно наносити «Пантенол» чи «Бепантен» на проепільовані зони по мірі необхідності.Протягом двох тижнів після епіляції варто уникати прямих сонячних променів або ж наносити сонцезахисний крем з високим фактором захисту (не менше ніж 35 SPF)."),
        String::from("Знеболювання робити не обов'язково, все індивідуально та залежить від больового порогу (якщо низький больовий поріг, тоді необхідно робити; якщо високий больовой поріг - знеболення можна не робити).\nДля знеболювання використовуємо крем Фрост Лайн, наноситься за 20 хвилин до процедури, вартість - 15 % від повної вартості зони. Або ж спрей Лідокаїн - наноситься під час процедури, вартість - 5 % від повної вартості зони. Різниця полягає в тому, що дія крему сильніше, аніж спрею."),
        String::from("Якщо Ви пройдете курс процедур, з призначеними нашим спеціалістом інтервалами та будете дотримуватись до- та післяпроцедурного режиму та Ви будете проводити 1 підтримуючу процедуру 1 раз в рік, не буде гормонального дисбалансу, то шкіра буде зберігати свою гладкість. Без підтримуючої процедури волосся відновить свій ріст через 3-5 років."),
        String::from("Якщо маєте бажання, можемо зараз записати Вас на процедуру лазерної епіляції або ж на консультацію, на я якій більш детально спеціаліст зможе відповісти на Ваші запитання після очного огляду. Консультація спеціаліста безкоштовна."),
        String::from("Ви пам'ятаєте протипоказання, підготовку та післяпроцедурний режим?"),
        String::from("Залишайтеся, будь ласка, онлайн. За декілька хвилин до чату приєднається консультант по Вашому місту.")
    ];

    let hints_ua = vec![
        "Курс процедур українською",
        "Інтервали",
        "Відмінності",
        "Підготовка",
        "Протипоказання",
        "Післяпроцедурний режим",
        "Результат після процедури",
        "Реабілітація",
        "Обезболювання",
        "ГАРАНТІЯ РЕЗУЛЬТАТУ",
        "Для запису",
        "Нагадування",
        "Онлайн‑консультант",
    ];

    let mut points = Vec::with_capacity(texts_ua.len());

    for (i, (text, hint)) in texts_ua
        .into_iter()
        .zip(hints_ua.into_iter())
        .enumerate()
    {
        let vector = embed(text.as_str()).await?;

        let payload = Payload::try_from(json!({
            "lang": "ua",
            "topic": "laser_epilation",
            "q_hint": hint,
            "answer_text": text,
        }))?;

        points.push(PointStruct::new(i as u64, vector, payload));
    }

    let upsert = UpsertPointsBuilder::new(COLLECTION_NAME, points).wait(true);
    client.upsert_points(upsert).await?;

    Ok(())
}
